### 淘米洗菜--数据预处理

#### 缺失值的处理

（1）python中直接调用info()方法就会返回每一列缺失的情况。python中缺失值一般用Nan表示。
（2）还可以使用isnull()方法来判断哪个值是缺失值，如果是缺失值返回True,如果不是缺失值则返回false  df.isnull()

In [2]:
import pandas as pd
# 指明读取的行数  nrows  encoding="utf-8"  encoding="gbk"
df=pd.read_csv(r".\file\test.csv",encoding="utf-8")
df.isnull()

      类别     书名     作者
0  False   True  False
1  False  False   True
2  False  False  False
3  False  False  False

#### 缺失值删除

缺失值分为2种，一种是一行种某个字段是缺失值，另一种是一行中字段的全部为缺失值，即为一个空白行
python中，利用的是dropna()方法其实默认删除含有缺失值的行，也就是某一行有缺失值就把这一行删除。返回的是删除后的数据。
如果想删除空白行，只需向dropna()方法中传入一个参数 how="all"即可。这样就会只删除那些全为空值的行。

In [3]:
df.dropna()  # df.dropna(how="all")

     类别        书名   作者
2  青春文学  《旅游结束时》   张启鑫
3    传记    《老舍自传》   老舍

#### 缺失值的填充

一般情况下只有数据缺失比列不是过高（不大于30%）,尽量别删除，而是选择填充
在python中，利用fillna()方法对数据表中的所有缺失值进行填充，在fillna()后面的括号中输入要填充的值即可

In [4]:
df

     类别        书名   作者
0    小说       NaN   老舍
1   散文集      《皮囊》  NaN
2  青春文学  《旅游结束时》   张启鑫
3    传记    《老舍自传》   老舍

In [5]:
df.fillna(0)

     类别        书名   作者
0    小说         0   老舍
1   散文集      《皮囊》    0
2  青春文学  《旅游结束时》   张启鑫
3    传记    《老舍自传》   老舍

在python中我们也可以按不同列填充，只要在fillna()方法的括号中指明列名即可。

In [6]:
df.fillna({"书名":"《非暴力沟通》"})

     类别        书名   作者
0    小说   《非暴力沟通》   老舍
1   散文集      《皮囊》  NaN
2  青春文学  《旅游结束时》   张启鑫
3    传记    《老舍自传》   老舍

In [7]:
df.fillna({"书名":"《非暴力沟通》","作者":"yxx"})

     类别        书名   作者
0    小说   《非暴力沟通》   老舍
1   散文集      《皮囊》  yxx
2  青春文学  《旅游结束时》   张启鑫
3    传记    《老舍自传》   老舍

#### 重复值的处理

重复数据就是同样的记录有多条，我们一般做删除操作
在python中我们利用 drop_duplicates()方法，该方法默认对所有值进行重复值判断，切默认保留第一个（行）值

In [23]:
df2=pd.read_table(r".\file\test.txt",sep=" ",encoding="utf-8")
df2

  订单编号 客户姓名  唯一识别码        成交时间
0   A1   张三    101  2019-01-02
1   A2   李四    102  2019-02-03
2   A3   王五    105  2019-03-01
3   A2   李四    102  2019-02-03

In [24]:
df2.drop_duplicates()

  订单编号 客户姓名  唯一识别码        成交时间
0   A1   张三    101  2019-01-02
1   A2   李四    102  2019-02-03
2   A3   王五    105  2019-03-01

指定列名，如果指定列名里面的内容重复就删除（去重），则需要传入参数 subset
df.drop_duplicates(subset=["客户姓名","唯一识别码"])

还可以自定义删除重复想时保留那个，默认保留第一个，也可以设置保留最后一个，或者全部不保留。
可以传入参数keep进行设置。keep的参数 first为默认值即保留第一个值。也可以是last，保留最后一个值，还可以是 False即把重复值全部删除
df.drop_duplicates(subset=["客户姓名","唯一识别码"],keep="last")

#### 异常值的检测与处理

异常值就是相比正常数据而言过高或者过低的数据
异常值的检测就是要发现异常值，其方式有三种：
（1）根据业务经验划定不同指标的正常范围，超出该范围的值算作异常值
（2）通过绘制箱型图，把大于（小于）箱型图上边缘（下边缘）的点称为异常值
（3）如果数据服从正态分布，则可以利用3a原则。如果一个数值与平均值之间的偏差超过3倍标准差，那么我们认为这个值就是异常值。

异常值的处理：
对于异常值一般有以下几种处理方式：
（1）最常用的处理方式是删除；
（2）把异常值当做缺失值来填充；
（3）把异常值当作特殊情况，研究异常值出现的原因；

对异常值进行填充，就是对异常值进行替换，利用replace()方法可以对特定的值进行替换。

#### 数据类型转换

python中使用dtype方法获取某一列数据类型

In [2]:
import pandas as pd
df2=pd.read_table(r".\file\test.txt",sep=" ",encoding="utf-8")
df2["订单编号"].dtype

dtype('O')

不同的类型可以做不同的事情，我们可以对数据进行类型转换，转换成我们需要的类型。
在python中使用 astype()方法对数据类型进行转换，astype后面的括号里指明要转换的目标类型即可。

In [4]:
df2["唯一识别码"].dtype

dtype('int64')

In [5]:
df2["唯一识别码"].astype("float64")

0    101.0
1    102.0
2    105.0
3    102.0
Name: 唯一识别码, dtype: float64

#### 索引设置

为无索引表添加索引：
给表 df的columns参数传入 列索引值，index参数传入 行索引值 ，达到为无索引表添加索引的目的；
df.columns=["订单编号","客户姓名","唯一识别码","成交时间"]
df.index=[1,2,3,4]

重新设置索引：
重新设置索引一般指行索引的设置。
在python中可以利用set_index()方法重新设置索引列。在set_index()里指明要用作行索引的列的名称即可。

In [6]:
import pandas as pd
df2=pd.read_table(r".\file\test.txt",sep=" ",encoding="utf-8")
df2.set_index("订单编号")

     客户姓名  唯一识别码        成交时间
订单编号
A1     张三    101  2019-01-02
A2     李四    102  2019-02-03
A3     王五    105  2019-03-01
A2     李四    102  2019-02-03

在重新设置索引时，可以给set_index()方法传入两个或多个列名。把这种一个表中用多列来做索引的方式称为层次化索引。
层次化索引一般用在某一列中含有多个重复值的情况下。
a   1  1
    2  2
b   1  4
    2  5
c   3  6
    4  7

重命名索引：是指针对现有索引名进行的修改，就是改字段名。
在python中重命名索引，利用rename()方法，在rename后的括号里指明要修改的行索引及列索引名

In [7]:
df2.rename(columns={"订单编号":"新订单编号","客户姓名":"新客户姓名"})

  新订单编号 新客户姓名  唯一识别码        成交时间
0    A1    张三    101  2019-01-02
1    A2    李四    102  2019-02-03
2    A3    王五    105  2019-03-01
3    A2    李四    102  2019-02-03

In [8]:
df2.rename(index={1:"一",2:"二"})

  订单编号 客户姓名  唯一识别码        成交时间
0   A1   张三    101  2019-01-02
一   A2   李四    102  2019-02-03
二   A3   王五    105  2019-03-01
3   A2   李四    102  2019-02-03

重置索引：
重置索引主要用在层次化索引表，重置索引是将索引列当做一个columns（列的设置）进行返回。
在python中利用的是reset_index()方法；
reset_index(level=None,drop=False,inplace=False)
    level参数用来指定要将层次化索引的第几级别转化为columns,第一个索引为0级，第二个索引为1级，默认为全部索引，即默认把索引全部转化为columns.
    drop参数用来指定是否将原索引删除掉，即不作为一个新的columns,默认为false,即不删除原索引。
    inplace参数用来指定是否修改原数据表。